ams/src/Reports/AMS_ДоговорыСПоставщиками/AMS_ДоговорыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>AMS_ДоговорыСПоставщиками</name>
</mdclass:Report>

ams/src/InformationRegisters/AMS_ДанныеДоговоров/AMS_ДанныеДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AMS_ДанныеДоговоров</name>
  <resources>
    <name>СторонаОформления</name>
    <comment>0 - партнер, 1 - наша организация</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СогласованРуководитель</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СогласованГлавбух</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СогласованЮрист</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СогласованДиректор</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОтправки</name>
    <comment>Почтой, курьеров, поставкой, доставкой</comment>
    <type>
      <types>EnumRef._СпособыОтправкиДоговора</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПолученияСкана</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПолученияОригинала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокУведомленияОбИзменениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредметДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </resources>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/Reports/AMS_ДоговорыСПоставщиками/Forms/ФормаОтчета/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем МемоСтатус;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастройкаФормы();
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПоказатьОтчет();
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьТекущиеДелаЭДО" Тогда
		ПоказатьОтчет();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаДоступаПриИзменении(Элемент)
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	Если Статус = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован") Тогда 
		СогласованРуководитель = Ложь;
		СогласованЮрист        = Ложь;
		СогласованГлавбух      = Ложь;
		СогласованДиректор     = Ложь;
	КонецЕсли;
	
	НастройкаФормы();
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ЗакупкиПриИзменении(Элемент)
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПолученияСканаПриИзменении(Элемент)
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПолученияОригиналаПриИзменении(Элемент)
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьЗакрытыеДоговорыПриИзменении(Элемент)
	Если СкрытьЗакрытыеДоговоры Тогда
		Статус = Неопределено;
	КонецЕсли;

	НастройкаФормы();
	ПоказатьОтчет();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабл

&НаКлиенте
Процедура ТаблПриАктивизацииСтроки(Элемент)
	Если Не Элемент.ТекущиеДанные = Неопределено Тогда
		Договор = Элемент.ТекущиеДанные.Договор;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Имя = Поле.Имя;  
	
	Если Имя = "ТаблПартнер" Или Имя = "ТаблКонтрагент" Или Имя = "ТаблДоговор" Тогда 
		ПоказатьЗначение(,Договор); 
		
	ИначеЕсли Имя = "ТаблПредметДоговора" Тогда
		ПредметДоговора = Элемент.ТекущиеДанные.ПредметДоговора;
		
		#Если ВебКлиент Тогда
		#Иначе
			Если ВвестиСтроку(ПредметДоговора,"Предмет договора",200,Истина) Тогда
				Элемент.ТекущиеДанные.ПредметДоговора = ПредметДоговора;
				ИзменитьДопДанныеДоговора(Договор,"ПредметДоговора",ПредметДоговора);
				ПоказатьОтчет();
		    КонецЕсли;	
		#КонецЕсли
	
	ИначеЕсли Имя = "ТаблГрафикОплаты" Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Соглашение); 
	
	ИначеЕсли Имя = "ТаблПлюс" Тогда 
		ОткрытьФорму("Отчет.AMS_ДоговорыСКлиентами.Форма.ФормаПриложений",
			Новый Структура("Договор",Договор),,,,,
			Новый ОписаниеОповещения("ОткрытьФормуПриложенийЗавершение",ЭтотОбъект),
		    РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблСтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МемоСтатус = ТекущийЭлемент.ТекущиеДанные.Статус;

	Элемент.СписокВыбора.Очистить();
	
	НеСогласован = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован");
	Действует    = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.СтатусыДоговоровКонтрагентов.Действует");
	
	Если МемоСтатус = НеСогласован Тогда
		Элементы.ТаблСтатус.СписокВыбора.Добавить(НеСогласован);
		Элементы.ТаблСтатус.СписокВыбора.Добавить(Действует);
	ИначеЕсли МемоСтатус = Действует Тогда
		Элементы.ТаблСтатус.СписокВыбора.Добавить(Действует);
		Элементы.ТаблСтатус.СписокВыбора.Добавить(ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.СтатусыДоговоровКонтрагентов.Закрыт"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблСтатусПриИзменении(Элемент)
	ТекСтатус = ТекущийЭлемент.ТекущиеДанные.Статус;
	
	Если ЗначениеЗаполнено(ТекСтатус) И ПравоИзмененияДоговора() Тогда
		ИзменитьДоговор(Договор,"Статус",ТекСтатус);
		ПоказатьОтчет();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблСпособДоставкиПриИзменении(Элемент)
	Если ПравоИзмененияДоговора() Тогда
		ИзменитьДопДанныеДоговора(Договор,"СпособДоставки",ТекущийЭлемент.ТекущиеДанные.СпособДоставки);
		ПоказатьОтчет();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблСторонаОформленияПриИзменении(Элемент)
	Если ПравоИзмененияДоговора() Тогда
		ИзменитьДопДанныеДоговора(Договор,"СторонаОформления",ТекущийЭлемент.ТекущиеДанные.СторонаОформления);
		ПоказатьОтчет();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблДатаНачалаДействияПриИзменении(Элемент)
	Если ПравоИзмененияДоговора() Тогда
		ИзменитьДоговор(Договор,"ДатаНачалаДействия",ТекущийЭлемент.ТекущиеДанные.ДатаНачалаДействия);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблДатаОкончанияДействияПриИзменении(Элемент)
	Если ПравоИзмененияДоговора() Тогда
		ИзменитьДоговор(Договор,"ДатаОкончанияДействия",ТекущийЭлемент.ТекущиеДанные.ДатаОкончанияДействия);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблСогласованРуководительПриИзменении(Элемент)
	ИзменитьДопДанныеДоговора(Договор,"СогласованРуководитель",ТекущийЭлемент.ТекущиеДанные.СогласованРуководитель);
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ТаблСогласованЮристПриИзменении(Элемент)
	ИзменитьДопДанныеДоговора(Договор,"СогласованЮрист",ТекущийЭлемент.ТекущиеДанные.СогласованЮрист);
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ТаблСогласованГлавбухПриИзменении(Элемент)
	ИзменитьДопДанныеДоговора(Договор,"СогласованГлавбух",ТекущийЭлемент.ТекущиеДанные.СогласованГлавбух);
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ТаблСогласованДиректорПриИзменении(Элемент)
	ИзменитьДопДанныеДоговора(Договор,"СогласованДиректор",ТекущийЭлемент.ТекущиеДанные.СогласованДиректор);
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ТаблСпособОтправкиПриИзменении(Элемент)
	ИзменитьДопДанныеДоговора(Договор,"СпособОтправки",ТекущийЭлемент.ТекущиеДанные.СпособОтправки);
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ТаблДатаОтправкиПриИзменении(Элемент)
	ИзменитьДопДанныеДоговора(Договор,"ДатаОтправки",ТекущийЭлемент.ТекущиеДанные.ДатаОтправки);
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ТаблДатаПолученияСканаПриИзменении(Элемент)
	ИзменитьДопДанныеДоговора(Договор,"ДатаПолученияСкана",ТекущийЭлемент.ТекущиеДанные.ДатаПолученияСкана);
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ТаблДатаПолученияОригиналаПриИзменении(Элемент)
	ИзменитьДопДанныеДоговора(Договор,"ДатаПолученияОригинала",ТекущийЭлемент.ТекущиеДанные.ДатаПолученияОригинала);
	ПоказатьОтчет();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ПоказатьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура Документы(Команда)
	ПараметрКоманды	= Новый Структура("Договор", Элементы.Табл.ТекущиеДанные.Договор);
	ОткрытьФорму("ОбщаяФорма.ДокументыПоДоговору", ПараметрКоманды, ЭтотОбъект, КлючУникальности);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкаФормы()
	Элементы.ГруппаДоступа.СписокВыбора.Очистить();
	Элементы.ГруппаДоступа.СписокВыбора.Добавить(Справочники.ГруппыДоступаПартнеров.НайтиПоНаименованию("Поставщики"));
	Элементы.ГруппаДоступа.СписокВыбора.Добавить(Справочники.ГруппыДоступаПартнеров.НайтиПоНаименованию("Перевозчики"));
	
	Элементы.Статус.СписокВыбора.Очистить();
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыДоговоровКонтрагентов.НеСогласован);
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыДоговоровКонтрагентов.Действует);
	Если Не СкрытьЗакрытыеДоговоры Тогда
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыДоговоровКонтрагентов.Закрыт);
	КонецЕсли;

	Если Не AMS_ВызовСервера.ЭтоKhors() Тогда
		ЭтоЮрист           = AMS_ВызовСервера.ДоступнаКонкретнаяРоль("_Юрист");
		ЭтоМенеджер        = Пользователи.РолиДоступны("_МенеджерЗакупок");
		ЭтоГлавБухгалтер   = AMS_ВызовСервера.ДоступнаКонкретнаяРоль("_ГлавныйБухгалтер");
		ЭтоДиректор        = AMS_ВызовСервера.ДоступнаКонкретнаяРоль("_Директор");
		ЭтоСекретарь       = AMS_ВызовСервера.ДоступнаКонкретнаяРоль("_Секретарь");
		
		Элементы.ТаблСтатус.ТолькоПросмотр                = Не ЭтоЮрист;
		Элементы.ТаблСторонаОформления.ТолькоПросмотр     = Не (ЭтоЮрист Или ЭтоМенеджер);
		Элементы.ТаблДатаНачалаДействия.ТолькоПросмотр    = Не (ЭтоЮрист Или ЭтоМенеджер);
		Элементы.ТаблДатаОкончанияДействия.ТолькоПросмотр = Не (ЭтоЮрист Или ЭтоМенеджер);
		Элементы.ТаблСогласованЮрист.ТолькоПросмотр       = Не ЭтоЮрист;
		Элементы.ТаблСогласованГлавбух.ТолькоПросмотр     = Не ЭтоГлавБухгалтер;
		Элементы.ТаблСогласованДиректор.ТолькоПросмотр    = Не (ЭтоГлавБухгалтер Или ЭтоДиректор);
		Элементы.ТаблСпособОтправки.ТолькоПросмотр        = Не ЭтоСекретарь;
		Элементы.ТаблДатаОтправки.ТолькоПросмотр          = Не ЭтоСекретарь;
		Элементы.ТаблДатаПолученияСкана.ТолькоПросмотр    = Не ЭтоЮрист;
		Элементы.ТаблДатаПолученияОригинала.ТолькоПросмотр= Не ЭтоСекретарь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();
	
	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Табл.Имя);

	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Табл.ДатаПолученияОригинала");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Табл.КоличествоЗакупок");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаПолностьюОбеспечен);
	
	//

	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Табл.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Табл.Статус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.СтатусыДоговоровКонтрагентов.Закрыт");

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗакрытыйДокумент);

	// Статус НЕ СОГЛАСОВАН

	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСтатус.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Табл.СогласованДиректор");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = '00010101';

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСогласованЮрист.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Табл.СогласованРуководитель");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	
	// Статус ДЕЙСТВУЕТ

	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблДатаНачалаДействия.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблДатаОкончанияДействия.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСогласованРуководитель.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСогласованЮрист.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСогласованГлавбух.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСогласованДиректор.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Табл.Статус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.СтатусыДоговоровКонтрагентов.Действует");

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Статус ЗАКРЫТ

	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСтатус.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСторонаОформления.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблДатаНачалаДействия.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблДатаОкончанияДействия.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСогласованРуководитель.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСогласованЮрист.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСогласованГлавбух.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСогласованДиректор.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСпособОтправки.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблДатаОтправки.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблДатаПолученияСкана.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблДатаПолученияОригинала.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Табл.Статус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.СтатусыДоговоровКонтрагентов.Закрыт");

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	//
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтчет()
	ПоказатьОтчетНаСервере();
	
    ИдентификаторСтроки = 0;
	Для каждого Стр Из Табл Цикл
		Если Стр.Договор = Договор Тогда
			ИдентификаторСтроки = Стр.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Элементы.Табл.ТекущаяСтрока = ИдентификаторСтроки;
КонецПроцедуры

&НаСервере
Процедура ПоказатьОтчетНаСервере()
	СКД = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");

	Настройки = СКД.НастройкиПоУмолчанию;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "ГруппаДоступа", ГруппаДоступа,
		ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(ГруппаДоступа));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "Ответственный", Ответственный,
		ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Ответственный));

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "Партнер", Партнер,
		ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Партнер));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "Контрагент", Контрагент,
		ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Контрагент));

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "Организация", Организация,
		ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Организация));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "Статус", Статус,
		ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Статус));
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "Статус", Перечисления.СтатусыДоговоровКонтрагентов.Закрыт,
		ВидСравненияКомпоновкиДанных.НеРавно, , СкрытьЗакрытыеДоговоры);

	Если Закупки = 0 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "КоличествоЗакупок", 0,
			ВидСравненияКомпоновкиДанных.Равно, , Ложь);
	ИначеЕсли Закупки = 1 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "КоличествоЗакупок", 0,
			ВидСравненияКомпоновкиДанных.Больше, , Истина);
	ИначеЕсли Закупки = 2 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "КоличествоЗакупок", 0,
			ВидСравненияКомпоновкиДанных.Равно, , Истина);
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "ПартнерЗакрыт", Ложь,
		ВидСравненияКомпоновкиДанных.Равно, , ПартнерЗакрыт);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "КонтрагентЗакрыт", Ложь,
		ВидСравненияКомпоновкиДанных.Равно, , КонтрагентЗакрыт);

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "СогласованРуководитель", , , ,
		СогласованРуководитель);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "СогласованЮрист", , , , СогласованЮрист);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "СогласованГлавбух", , , , СогласованГлавбух);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "СогласованДиректор", , , ,
		СогласованДиректор);

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "ДатаПолученияСкана", , , ,
		ДатаПолученияСкана);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "ДатаПолученияОригинала", , , ,
		ДатаПолученияОригинала);
		
	Таб = Новый ТаблицаЗначений;

	мср.ПолучитьДанныеНаОснованииСКД(СКД, Таб, Настройки, Неопределено);

	Табл.Очистить();
	Для Каждого Стр Из Таб Цикл 
		НовСтр = Табл.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		НовСтр.ГрафикОплаты = ?(ЗначениеЗаполнено(Стр.ВариантОплаты), "" + Стр.ВариантОплаты + " " + Стр.Сдвиг + " дн. "
			+ Стр.ВариантОтсчета, "");
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПравоИзмененияДоговора()
	Возврат ПравоДоступа("Изменение", Метаданные.Справочники.ДоговорыКонтрагентов);
КонецФункции

&НаСервереБезКонтекста
Процедура ИзменитьДоговор(Договор,Реквизит,Значение)
	ДоговорОбъект = Договор.ПолучитьОбъект();
	ДоговорОбъект[Реквизит] = Значение;
	ДоговорОбъект.Записать();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьДопДанныеДоговора(Договор,Реквизит,Значение)
	Запись = РегистрыСведений.AMS_ДанныеДоговоров.СоздатьМенеджерЗаписи();
	
	Запись.Договор = Договор;
	
	Запись.Прочитать();
	
	Запись.Договор = Договор;
	Запись[Реквизит] = Значение;
	
	Запись.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПриложенийЗавершение(Результат,ДополнительныеПераметры) Экспорт
	Если Не Результат = Неопределено Тогда
		ПоказатьОтчет();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТаблСтатусПриИзмененииЗавершение(КодВозврата,ДополнительныеПараметры) Экспорт
	Если КодВозврата = КодВозвратаДиалога.Да Тогда
		ИзменитьДоговор(Договор,"Статус",ТекущийЭлемент.ТекущиеДанные.Статус);
	Иначе
		ТекущийЭлемент.ТекущиеДанные.Статус = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован")
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
